       IDENTIFICATION DIVISION.
       PROGRAM-ID. FIZBUZZ.
       ENVIRONMENT DIVISION.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 NUM PIC 999.
       PROCEDURE DIVISION.
           PERFORM VARYING NUM FROM 1 BY 1 UNTIL NUM > 100
               IF FUNCTION MOD (NUM, 15) = 0 THEN DISPLAY 'FIZZBUZZ'
               ELSE IF FUNCTION MOD (NUM, 3) = 0 THEN DISPLAY 'FIZZ'
               ELSE IF FUNCTION MOD (NUM, 5) = 0 THEN DISPLAY 'BUZZ'
               ELSE DISPLAY NUM
           END-PERFORM.
           STOP RUN.
           