       identification division.
       program-id. palindrome.

       environment division.
       

       data division.
       

       procedure division.
       

       
       